HuoYingCunCunZhang/toys_daozha/firmware/gate/sdkconfig.defaults
# 目标：ESP32-S3-DevKitC-1 N16R8（16MB flash + 8MB 八线 PSRAM）
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM：ESP-SR 的模型和 AFE 缓冲要用，M0 的验收标准就是它被识别到
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_FREERTOS_HZ=1000

# 板载 USB-JTAG 直接出日志，不用外接串口
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
